# import akshare as ak
# res = ak.fund_overview_em(symbol="000001")
# print(res.columns.tolist())
# print(res.head())


import akshare as ak

# fund_lof_hist_em_df = ak.fund_lof_hist_em(symbol="166009", period="daily", start_date="20200101", end_date="20260220", adjust="hfq")
# print(fund_lof_hist_em_df)


# fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="000004", indicator="累计收益率走势")
# print(fund_open_fund_info_em_df)

# import akshare as ak

# fund_purchase_em_df = ak.fund_purchase_em()
# print(fund_purchase_em_df)

# fund_name_em_df = ak.fund_name_em()
# print(fund_name_em_df)

# fund_purchase_em_df = ak.fund_purchase_em()
# print(fund_purchase_em_df)

fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="161606", indicator="分红送配详情")
print(fund_open_fund_info_em_df)

fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="000084", indicator="分红送配详情")
print(fund_open_fund_info_em_df)
#        年份       权益登记日         除息日          每份分红       分红发放日
# 0   2021年  2021-12-16  2021-12-16  每份派现金0.1584元  2021-12-20
# 1   2020年  2020-08-10  2020-08-10  每份派现金0.0820元  2020-08-12
# 2   2019年  2019-09-24  2019-09-24  每份派现金0.1000元  2019-09-26
# 3   2018年  2018-09-19  2018-09-19  每份派现金0.1821元  2018-09-21
# 4   2017年  2017-08-28  2017-08-28  每份派现金0.2647元  2017-08-30
# 5   2016年  2016-12-12  2016-12-12  每份派现金0.6108元  2016-12-14
# 6   2015年  2015-01-13  2015-01-13  每份派现金0.1030元  2015-01-15
# 7   2014年  2014-07-17  2014-07-17  每份派现金0.0300元  2014-07-21
# 8   2011年  2011-12-20  2011-12-20  每份派现金0.0580元  2011-12-22
# 9   2010年  2010-10-20  2010-10-20  每份派现金0.0800元  2010-10-22
# 10  2009年  2009-08-17  2009-08-17  每份派现金0.1000元  2009-08-19
# 11  2008年  2008-12-19  2008-12-19  每份派现金0.0420元  2008-12-23
# 12  2007年  2007-06-25  2007-06-25  每份派现金0.1300元  2007-06-27
# 13  2006年  2006-03-13  2006-03-13  每份派现金0.0760元  2006-03-15
# 14  2006年  2006-01-24  2006-01-24  每份派现金0.0240元  2006-02-06

fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="163402", indicator="拆分详情")
print(fund_open_fund_info_em_df)
#       年份       拆分折算日  拆分类型    拆分折算比例
# 0  2007年  2007-05-11  份额折算  1:3.9939


fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="163402", indicator="单位净值走势")
print(fund_open_fund_info_em_df)
#             净值日期    单位净值  日增长率
# 0     2005-11-03  1.0000  0.00
# 1     2005-11-11  0.9999 -0.01
# 2     2005-11-16  0.9999  0.00
# 3     2005-11-17  0.9999  0.00
# 4     2005-11-18  1.0007  0.08
# ...          ...     ...   ...
# 4932  2026-02-09  0.8015  2.35
# 4933  2026-02-10  0.8060  0.56
# 4934  2026-02-11  0.8029 -0.38
# 4935  2026-02-12  0.8105  0.95
# 4936  2026-02-13  0.8002 -1.27

fund_announcement_personnel_em_df = ak.fund_announcement_personnel_em(symbol="000001")
print(fund_announcement_personnel_em_df)

#       基金代码                               公告标题    基金名称        公告日期                  报告ID
# 0   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2013-06-29  AN201306290003484248
# 1   000001    华夏基金管理有限公司关于增聘华夏成长证券投资基金基金经理的公告  华夏成长混合  2014-03-18  AN201403180005270024
# 2   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2014-06-21  AN201406210006119867
# 3   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2015-01-09  AN201501090008098479
# 4   000001  华夏基金管理有限公司关于调整华夏成长证券投资公告基金基金经理的公告  华夏成长混合  2015-11-21  AN201511210011484696
# 5   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2017-01-14  AN201701140268312342
# 6   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2017-02-25  AN201702250364410226
# 7   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2017-03-30  AN201703300451418174
# 8   000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2021-02-24  AN202102241464811736
# 9   000001    华夏基金管理有限公司关于增聘华夏成长证券投资基金基金经理的公告  华夏成长混合  2021-09-18  AN202109181516930266
# 10  000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2022-04-13  AN202204131558964253
# 11  000001    华夏基金管理有限公司关于调整华夏成长证券投资基金基金经理的公告  华夏成长混合  2022-10-29  AN202210291579611414



fund_open_fund_info_em_df = ak.fund_open_fund_info_em(symbol="000141", indicator="累计收益率走势", period="成立来")
print(fund_open_fund_info_em_df)
#              日期   累计收益率
# 0    2019-03-19    0.00
# 1    2019-04-02    0.06
# 2    2019-04-15    0.23
# 3    2019-04-25    0.20
# 4    2019-05-10   -1.68
# ..          ...     ...
# 207  2026-01-09  213.27
# 208  2026-01-21  229.22